## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/b58fdb1e-6700-4d4d-9fd2-d046e356887d/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_app.app will be created
  + resource "azurerm_container_app" "app" {
      + container_app_environment_id  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae"
      + custom_domain_verification_id = (sensitive value)
      + id                            = (known after apply)
      + latest_revision_fqdn          = (known after apply)
      + latest_revision_name          = (known after apply)
      + location                      = (known after apply)
      + name                          = "biotrackr-activityapi-svc"
      + outbound_ip_addresses         = (known after apply)
      + resource_group_name           = "rg-biotrackr-prod-ae"
      + revision_mode                 = "Single"
      + tags                          = {
          + "Application" = "biotrackr"
          + "Component"   = "ActivityApi"
          + "environment" = "Production"
          + "owner"       = "willvelida"
        }

      + dapr {
          + app_id       = "biotrackr-activityapi-svc"
          + app_protocol = "http"
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + ingress {
          + allow_insecure_connections = false
          + external_enabled           = false
          + fqdn                       = (known after apply)
          + target_port                = 8081
          + transport                  = "auto"

          + custom_domain (known after apply)

          + traffic_weight {
              + latest_revision = true
              + percentage      = 100
            }
        }

      + registry {
          + identity = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae"
          + server   = "acrbiotrackrprodae.azurecr.io"
        }

      + template {
          + max_replicas    = 1
          + min_replicas    = 1
          + revision_suffix = (known after apply)

          + container {
              + cpu               = 0.25
              + ephemeral_storage = (known after apply)
              + image             = "acrbiotrackrprodae.azurecr.io/biotrackr-activityapi-svc:6092b1022d5c23d894d27f8d4872a7350c711260"
              + memory            = "0.5Gi"
              + name              = "biotrackr-activityapi-svc"

              + env {
                  + name  = "managedidentityclientid"
                  + value = "e0077542-1278-4f86-95e5-836782e55be2"
                }
              + env {
                  + name  = "azureappconfigendpoint"
                  + value = "https://appconfig-biotrackr-prod-ae.azconfig.io"
                }
              + env {
                  + name  = "appinsightsconnectionstring"
                  + value = (sensitive value)
                }

              + liveness_probe {
                  + failure_count_threshold          = 3
                  + initial_delay                    = 15
                  + interval_seconds                 = 30
                  + path                             = "/healthz/liveness"
                  + port                             = 8081
                  + termination_grace_period_seconds = (known after apply)
                  + timeout                          = 1
                  + transport                        = "HTTPS"
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # azurerm_container_app.app will be created%0A  + resource "azurerm_container_app" "app" {%0A      + container_app_environment_id  = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.App/managedEnvironments/env-biotrackr-prod-ae"%0A      + custom_domain_verification_id = (sensitive value)%0A      + id                            = (known after apply)%0A      + latest_revision_fqdn          = (known after apply)%0A      + latest_revision_name          = (known after apply)%0A      + location                      = (known after apply)%0A      + name                          = "biotrackr-activityapi-svc"%0A      + outbound_ip_addresses         = (known after apply)%0A      + resource_group_name           = "rg-biotrackr-prod-ae"%0A      + revision_mode                 = "Single"%0A      + tags                          = {%0A          + "Application" = "biotrackr"%0A          + "Component"   = "ActivityApi"%0A          + "environment" = "Production"%0A          + "owner"       = "willvelida"%0A        }%0A%0A      + dapr {%0A          + app_id       = "biotrackr-activityapi-svc"%0A          + app_protocol = "http"%0A        }%0A%0A      + identity {%0A          + identity_ids = [%0A              + "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae",%0A            ]%0A          + principal_id = (known after apply)%0A          + tenant_id    = (known after apply)%0A          + type         = "UserAssigned"%0A        }%0A%0A      + ingress {%0A          + allow_insecure_connections = false%0A          + external_enabled           = false%0A          + fqdn                       = (known after apply)%0A          + target_port                = 8081%0A          + transport                  = "auto"%0A%0A          + custom_domain (known after apply)%0A%0A          + traffic_weight {%0A              + latest_revision = true%0A              + percentage      = 100%0A            }%0A        }%0A%0A      + registry {%0A          + identity = "/subscriptions/77348e6c-0286-496f-8336-28e966b13648/resourceGroups/rg-biotrackr-prod-ae/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-biotrackr-prod-ae"%0A          + server   = "acrbiotrackrprodae.azurecr.io"%0A        }%0A%0A      + template {%0A          + max_replicas    = 1%0A          + min_replicas    = 1%0A          + revision_suffix = (known after apply)%0A%0A          + container {%0A              + cpu               = 0.25%0A              + ephemeral_storage = (known after apply)%0A              + image             = "acrbiotrackrprodae.azurecr.io/biotrackr-activityapi-svc:6092b1022d5c23d894d27f8d4872a7350c711260"%0A              + memory            = "0.5Gi"%0A              + name              = "biotrackr-activityapi-svc"%0A%0A              + env {%0A                  + name  = "managedidentityclientid"%0A                  + value = "e0077542-1278-4f86-95e5-836782e55be2"%0A                }%0A              + env {%0A                  + name  = "azureappconfigendpoint"%0A                  + value = "https://appconfig-biotrackr-prod-ae.azconfig.io"%0A                }%0A              + env {%0A                  + name  = "appinsightsconnectionstring"%0A                  + value = (sensitive value)%0A                }%0A%0A              + liveness_probe {%0A                  + failure_count_threshold          = 3%0A                  + initial_delay                    = 15%0A                  + interval_seconds                 = 30%0A                  + path                             = "/healthz/liveness"%0A                  + port                             = 8081%0A                  + termination_grace_period_seconds = (known after apply)%0A                  + timeout                          = 1%0A                  + transport                        = "HTTPS"%0A                }%0A            }%0A        }%0A    }%0A%0APlan: 1 to add, 0 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>